<template>
	<view class="privacyPolicy">
		<view class="title">
			隐私政策
		</view>
		<p>家易通政隐私政策（以下简称“本政策”）是由家易通政服务有限公司（以下简称“家易通”或“我们”）制定的，旨在向您说明我们在收集、使用、共享和保护您的个人信息时遵循的原则和规则，以及您享有的相关权利。本政策适用于您通过无忧家政平台（包括无忧家政网站、移动应用软件、小程序等）使用我们提供的各项服务。</p>
		<p>在使用我们的服务前，请您仔细阅读并充分理解本政策的全部内容，特别是其中与您的权益密切相关的条款，如有任何疑问，您可以通过我们的联系方式与我们沟通。如果您不同意本政策的任何内容，您应立即停止使用我们的服务。当您使用我们的任一服务时，即表示您已同意我们按照本政策来合法使用和保护您的个人信息。</p>
		<p>一、我们如何收集您的个人信息</p>
		<p>我们收集您的个人信息是为了向您提供更优质、更个性化的服务，我们会按照法律法规的规定和本政策的约定，出于以下目的收集和使用您的个人信息：</p>
		<p>（一）为您提供注册和登录服务</p>
		<p>当您注册家易通平台账号时，我们会要求您提供手机号码，并通过发送短信验证码或与通信运营商认证本机号码的方式来验证您的身份是否有效。如果您拒绝提供手机号码，您将无法注册家易通平台账号并使用我们的服务。</p>
		<p>（二）为您提供商品/服务展示和搜索功能</p>
		<p>为了向您提供周边生活服务信息的展示和搜索服务，我们会收集和使用您在使用我们服务过程中产生的相关信息，包括：</p>
		<p>位置信息：您可以自主选择是否授权家易通开启移动设备的定位功能，如您同意授权开启定位功能，家易通会收集和使用您的位置信息以便为您推荐周边的生活服务，以便您无需手动输入所在地理位置就可获得您所在地区的服务。我们会使用有关技术获取您的位置信息（准确度会有所不同），这些技术包括IP地址、GPS以及能够提供相关信息的WLAN（如Wi-Fi）接入点、蓝牙和基站等。您可以在移动设备的系统中关闭定位服务停止我们对您所在位置信息的收集，但可能因此无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。</p>
		<p>日志信息：当您使用家易通平台时，我们会收集您的浏览、搜索记录等信息并作为有关网络日志进行保存，包括您的IP地址、浏览器的类型、使用的语言、操作系统的版本、访问的日期和时间、发布的信息、浏览、搜索、网络请求等。</p>
		<p>（三）为您提供商品/服务购买和交易服务</p>
		<p>当您在家易通平台预约下单购买商品/服务时，我们会收集和使用您的以下信息，以便帮助您顺利完成交易、保障您的交易安全、查询订单信息、提供客服咨询服务：</p>
		<p>订单信息：您需要提供您需要的具体服务项目、服务/收货地址、手机号码、服务时间等信息。当您填写完前述必要订单信息进行预约下单后，家易通平台会生成您购买该商品或服务的订单，订单中会显示您选择的具体服务项目、收货人姓名、服务/收货地址、手机号码、服务时间、您应/已支付的部分或全部的商品/服务金额、订单编号、下单时间等信息。</p>
		<p>通讯信息：您在家易通平台服务的过程中，如通过家易通平台接打电话或微信、网站IM系统进行沟通时，我们会收集您的通讯内容、通话时长、主被叫手机号码信息，以及您通过家易通平台发送的文字信息内容。我们会使用这些信息作为解决相关纠纷的参考依据，以及为您提供更好的服务。</p>
		<p>（四）为您提供其他功能和服务</p>
		<p>除上述服务外，我们还会为您提供其他功能和服务，例如用户评价、投诉举报、客服咨询、活动推广等。为了向您提供这些功能和服务，我们可能需要收集和使用您的一些必要信息，例如您的账号信息、订单信息、评价内容、投诉举报内容、联系方式等。如果您拒绝提供这些信息，您可能无法享受这些功能和服务，但不影响您使用我们的核心服务。</p>
		<p>二、我们如何使用Cookie和同类技术</p>
		<p>（一）Cookie的使用</p>
		<p>为了实现家易通平台的某些功能，我们可能会在您的计算机或移动设备上存储名为Cookie的小数据文件，以便更好地了解您的浏览习惯，优化您的用户体验，以及为您提供个性化的服务和广告。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，家易通平台能够记录您的偏好或购物车内的商品等数据。</p>
		<p>您可以通过浏览器的设置管理或删除Cookie。您可以清除计算机上保存的所有Cookie，大部分网络浏览器都设有阻止Cookie的功能。但如果您这么做，则需要在每一次访问家易通平台时亲自更改用户设置。有关详情，请参见浏览器的使用说明。</p>
		<p>（二）同类技术的使用</p>
		<p>除Cookie外，我们还会在家易通平台中使用其他同类技术，例如网络Beacon和像素标签等。这些技术帮助我们了解家易通平台的用户行为，例如访问次数、停留时间等，以便我们改进家易通平台的性能和服务质量。</p>
		<p>三、我们如何共享、转让、公开披露您的个人信息</p>
		<p>（一）共享</p>
		<p>我们不会与家易通以外的任何公司、组织和个人共享您的个人信息，除非以下情况：</p>
		<p>在获得您的明确同意后，我们会与其他方共享您的个人信息。</p>
		<p>我们可能会根据法律法规的规定，或按照政府或法律法规授权的机构的强制性要求，对外共享您的个人信息。</p>
		<p>我们可能会与我们的关联公司共享您的个人信息，以便为您提供更优质、更个性化的服务，或者实现我们的合法利益。我们只会共享必要的个人信息，并且受本政策中所声明的目的的约束。</p>
		<view class="end"></view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style lang="scss" scoped>
.privacyPolicy{
		margin: 100upx 20upx;
		.title{
			font-size: 40upx;
			font-weight: 600;
			border-bottom: 1px solid var(--borderColor);
			padding: 10upx 0;
			margin-bottom: 10upx;
		}
		p{
			text{
				font-weight: 600;
				margin: 0 10upx;
			}
		}
		.zero{
			height: 40upx;
		}
		.end{
			height: 200upx;
		}
	}
</style>
